; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image1 - mode
	infrared2 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star0 - direction
	Star4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 159)
	(= (data Phenomenon5 image1) 118)
	(= (data Star6 image1) 62)
	(= (data Phenomenon7 image1) 235)
	(= (data Phenomenon8 image1) 236)
	(= (data Star9 image1) 182)
	(= (data Planet10 image1) 43)
	(= (data Star11 image1) 35)
	(= (data Planet12 image1) 14)
	(= (data Phenomenon5 infrared2) 183)
	(= (data Star6 infrared2) 27)
	(= (data Phenomenon7 infrared2) 165)
	(= (data Phenomenon8 infrared2) 164)
	(= (data Star9 infrared2) 213)
	(= (data Planet10 infrared2) 2)
	(= (data Star11 infrared2) 152)
	(= (data Planet12 infrared2) 74)
	(= (data Phenomenon5 spectrograph0) 96)
	(= (data Star6 spectrograph0) 257)
	(= (data Phenomenon7 spectrograph0) 271)
	(= (data Phenomenon8 spectrograph0) 158)
	(= (data Star9 spectrograph0) 89)
	(= (data Planet10 spectrograph0) 207)
	(= (data Star11 spectrograph0) 195)
	(= (data Planet12 spectrograph0) 281)
	(= (slew_time GroundStation1 Star0) 91.16)
	(= (slew_time Star0 GroundStation1) 91.16)
	(= (slew_time GroundStation2 Star0) 54.2)
	(= (slew_time Star0 GroundStation2) 54.2)
	(= (slew_time GroundStation2 GroundStation1) 41.53)
	(= (slew_time GroundStation1 GroundStation2) 41.53)
	(= (slew_time GroundStation3 Star0) 18.09)
	(= (slew_time Star0 GroundStation3) 18.09)
	(= (slew_time GroundStation3 GroundStation1) 33.92)
	(= (slew_time GroundStation1 GroundStation3) 33.92)
	(= (slew_time GroundStation3 GroundStation2) 20.76)
	(= (slew_time GroundStation2 GroundStation3) 20.76)
	(= (slew_time Star4 Star0) 33.86)
	(= (slew_time Star0 Star4) 33.86)
	(= (slew_time Star4 GroundStation1) 28.17)
	(= (slew_time GroundStation1 Star4) 28.17)
	(= (slew_time Star4 GroundStation2) 64.86)
	(= (slew_time GroundStation2 Star4) 64.86)
	(= (slew_time Star4 GroundStation3) 46.87)
	(= (slew_time GroundStation3 Star4) 46.87)
	(= (slew_time Phenomenon5 Star0) 48.9)
	(= (slew_time Star0 Phenomenon5) 48.9)
	(= (slew_time Phenomenon5 GroundStation1) 40.37)
	(= (slew_time GroundStation1 Phenomenon5) 40.37)
	(= (slew_time Phenomenon5 GroundStation2) 47.99)
	(= (slew_time GroundStation2 Phenomenon5) 47.99)
	(= (slew_time Phenomenon5 GroundStation3) 75.01)
	(= (slew_time GroundStation3 Phenomenon5) 75.01)
	(= (slew_time Phenomenon5 Star4) 10.34)
	(= (slew_time Star4 Phenomenon5) 10.34)
	(= (slew_time Star6 Star0) 41.19)
	(= (slew_time Star0 Star6) 41.19)
	(= (slew_time Star6 GroundStation1) 48.38)
	(= (slew_time GroundStation1 Star6) 48.38)
	(= (slew_time Star6 GroundStation2) 38.36)
	(= (slew_time GroundStation2 Star6) 38.36)
	(= (slew_time Star6 GroundStation3) 28.47)
	(= (slew_time GroundStation3 Star6) 28.47)
	(= (slew_time Star6 Star4) 40.48)
	(= (slew_time Star4 Star6) 40.48)
	(= (slew_time Star6 Phenomenon5) 18.91)
	(= (slew_time Phenomenon5 Star6) 18.91)
	(= (slew_time Phenomenon7 Star0) 33.7)
	(= (slew_time Star0 Phenomenon7) 33.7)
	(= (slew_time Phenomenon7 GroundStation1) 20.48)
	(= (slew_time GroundStation1 Phenomenon7) 20.48)
	(= (slew_time Phenomenon7 GroundStation2) 5.369)
	(= (slew_time GroundStation2 Phenomenon7) 5.369)
	(= (slew_time Phenomenon7 GroundStation3) 11.16)
	(= (slew_time GroundStation3 Phenomenon7) 11.16)
	(= (slew_time Phenomenon7 Star4) 8.556)
	(= (slew_time Star4 Phenomenon7) 8.556)
	(= (slew_time Phenomenon7 Phenomenon5) 43.77)
	(= (slew_time Phenomenon5 Phenomenon7) 43.77)
	(= (slew_time Phenomenon7 Star6) 37.31)
	(= (slew_time Star6 Phenomenon7) 37.31)
	(= (slew_time Phenomenon8 Star0) 18.76)
	(= (slew_time Star0 Phenomenon8) 18.76)
	(= (slew_time Phenomenon8 GroundStation1) 16.05)
	(= (slew_time GroundStation1 Phenomenon8) 16.05)
	(= (slew_time Phenomenon8 GroundStation2) 47.36)
	(= (slew_time GroundStation2 Phenomenon8) 47.36)
	(= (slew_time Phenomenon8 GroundStation3) 6.327)
	(= (slew_time GroundStation3 Phenomenon8) 6.327)
	(= (slew_time Phenomenon8 Star4) 27.51)
	(= (slew_time Star4 Phenomenon8) 27.51)
	(= (slew_time Phenomenon8 Phenomenon5) 45.99)
	(= (slew_time Phenomenon5 Phenomenon8) 45.99)
	(= (slew_time Phenomenon8 Star6) 13.56)
	(= (slew_time Star6 Phenomenon8) 13.56)
	(= (slew_time Phenomenon8 Phenomenon7) 35.39)
	(= (slew_time Phenomenon7 Phenomenon8) 35.39)
	(= (slew_time Star9 Star0) 7.823)
	(= (slew_time Star0 Star9) 7.823)
	(= (slew_time Star9 GroundStation1) 12.36)
	(= (slew_time GroundStation1 Star9) 12.36)
	(= (slew_time Star9 GroundStation2) 73.46)
	(= (slew_time GroundStation2 Star9) 73.46)
	(= (slew_time Star9 GroundStation3) 28.04)
	(= (slew_time GroundStation3 Star9) 28.04)
	(= (slew_time Star9 Star4) 18.49)
	(= (slew_time Star4 Star9) 18.49)
	(= (slew_time Star9 Phenomenon5) 11.94)
	(= (slew_time Phenomenon5 Star9) 11.94)
	(= (slew_time Star9 Star6) 61.39)
	(= (slew_time Star6 Star9) 61.39)
	(= (slew_time Star9 Phenomenon7) 23.53)
	(= (slew_time Phenomenon7 Star9) 23.53)
	(= (slew_time Star9 Phenomenon8) 45.19)
	(= (slew_time Phenomenon8 Star9) 45.19)
	(= (slew_time Planet10 Star0) 0.8245)
	(= (slew_time Star0 Planet10) 0.8245)
	(= (slew_time Planet10 GroundStation1) 46.08)
	(= (slew_time GroundStation1 Planet10) 46.08)
	(= (slew_time Planet10 GroundStation2) 18.56)
	(= (slew_time GroundStation2 Planet10) 18.56)
	(= (slew_time Planet10 GroundStation3) 34.75)
	(= (slew_time GroundStation3 Planet10) 34.75)
	(= (slew_time Planet10 Star4) 11.35)
	(= (slew_time Star4 Planet10) 11.35)
	(= (slew_time Planet10 Phenomenon5) 16.49)
	(= (slew_time Phenomenon5 Planet10) 16.49)
	(= (slew_time Planet10 Star6) 13.98)
	(= (slew_time Star6 Planet10) 13.98)
	(= (slew_time Planet10 Phenomenon7) 6.876)
	(= (slew_time Phenomenon7 Planet10) 6.876)
	(= (slew_time Planet10 Phenomenon8) 8.656)
	(= (slew_time Phenomenon8 Planet10) 8.656)
	(= (slew_time Planet10 Star9) 38.56)
	(= (slew_time Star9 Planet10) 38.56)
	(= (slew_time Star11 Star0) 43.81)
	(= (slew_time Star0 Star11) 43.81)
	(= (slew_time Star11 GroundStation1) 2.502)
	(= (slew_time GroundStation1 Star11) 2.502)
	(= (slew_time Star11 GroundStation2) 18.12)
	(= (slew_time GroundStation2 Star11) 18.12)
	(= (slew_time Star11 GroundStation3) 32.74)
	(= (slew_time GroundStation3 Star11) 32.74)
	(= (slew_time Star11 Star4) 15.55)
	(= (slew_time Star4 Star11) 15.55)
	(= (slew_time Star11 Phenomenon5) 20.21)
	(= (slew_time Phenomenon5 Star11) 20.21)
	(= (slew_time Star11 Star6) 43.07)
	(= (slew_time Star6 Star11) 43.07)
	(= (slew_time Star11 Phenomenon7) 9.126)
	(= (slew_time Phenomenon7 Star11) 9.126)
	(= (slew_time Star11 Phenomenon8) 20.3)
	(= (slew_time Phenomenon8 Star11) 20.3)
	(= (slew_time Star11 Star9) 52.19)
	(= (slew_time Star9 Star11) 52.19)
	(= (slew_time Star11 Planet10) 79.88)
	(= (slew_time Planet10 Star11) 79.88)
	(= (slew_time Planet12 Star0) 66.81)
	(= (slew_time Star0 Planet12) 66.81)
	(= (slew_time Planet12 GroundStation1) 15.52)
	(= (slew_time GroundStation1 Planet12) 15.52)
	(= (slew_time Planet12 GroundStation2) 23.52)
	(= (slew_time GroundStation2 Planet12) 23.52)
	(= (slew_time Planet12 GroundStation3) 31.4)
	(= (slew_time GroundStation3 Planet12) 31.4)
	(= (slew_time Planet12 Star4) 3.875)
	(= (slew_time Star4 Planet12) 3.875)
	(= (slew_time Planet12 Phenomenon5) 10.98)
	(= (slew_time Phenomenon5 Planet12) 10.98)
	(= (slew_time Planet12 Star6) 6.575)
	(= (slew_time Star6 Planet12) 6.575)
	(= (slew_time Planet12 Phenomenon7) 78.67)
	(= (slew_time Phenomenon7 Planet12) 78.67)
	(= (slew_time Planet12 Phenomenon8) 23.76)
	(= (slew_time Phenomenon8 Planet12) 23.76)
	(= (slew_time Planet12 Star9) 38.85)
	(= (slew_time Star9 Planet12) 38.85)
	(= (slew_time Planet12 Planet10) 18.82)
	(= (slew_time Planet10 Planet12) 18.82)
	(= (slew_time Planet12 Star11) 7.83)
	(= (slew_time Star11 Planet12) 7.83)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Phenomenon5 infrared2)
	(have_image Star6 infrared2)
	(have_image Phenomenon7 infrared2)
	(have_image Phenomenon8 image1)
	(have_image Planet10 infrared2)
	(have_image Star11 infrared2)
	(have_image Planet12 infrared2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 159 to 118.52, (fuel-used) from 0 to 40.48
   goals met: 0 of 7
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
3. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 7
4. (turn_to satellite0 phenomenon7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 118.52 to 109.964, (fuel-used) from 40.48 to 49.036
   goals met: 0 of 7
5. (take_image satellite0 phenomenon7 instrument1 infrared2)
   added: (have_image phenomenon7 infrared2)
   changed: (data_capacity satellite0) from 1000 to 835, (data-stored) from 0 to 165
   goals met: 1 of 7
6. (turn_to satellite0 phenomenon5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 109.964 to 66.194, (fuel-used) from 49.036 to 92.806
   goals met: 1 of 7
7. (take_image satellite0 phenomenon5 instrument1 infrared2)
   added: (have_image phenomenon5 infrared2)
   changed: (data_capacity satellite0) from 835 to 652, (data-stored) from 165 to 348
   goals met: 2 of 7
8. (turn_to satellite0 star6 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 66.194 to 47.284, (fuel-used) from 92.806 to 111.716
   goals met: 2 of 7
9. (take_image satellite0 star6 instrument1 infrared2)
   added: (have_image star6 infrared2)
   changed: (data_capacity satellite0) from 652 to 625, (data-stored) from 348 to 375
   goals met: 3 of 7
10. (turn_to satellite0 planet12 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet12)
   changed: (fuel satellite0) from 47.284 to 40.709, (fuel-used) from 111.716 to 118.291
   goals met: 3 of 7
11. (take_image satellite0 planet12 instrument1 infrared2)
   added: (have_image planet12 infrared2)
   changed: (data_capacity satellite0) from 625 to 551, (data-stored) from 375 to 449
   goals met: 4 of 7
12. (turn_to satellite0 star11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star11)
   changed: (fuel satellite0) from 40.709 to 32.879, (fuel-used) from 118.291 to 126.121
   goals met: 4 of 7
13. (take_image satellite0 star11 instrument1 infrared2)
   added: (have_image star11 infrared2)
   changed: (data_capacity satellite0) from 551 to 399, (data-stored) from 449 to 601
   goals met: 5 of 7
14. (turn_to satellite0 phenomenon7 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 32.879 to 23.753, (fuel-used) from 126.121 to 135.247
   goals met: 5 of 7
15. (turn_to satellite0 planet10 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 23.753 to 16.877, (fuel-used) from 135.247 to 142.123
   goals met: 5 of 7
16. (take_image satellite0 planet10 instrument1 infrared2)
   added: (have_image planet10 infrared2)
   changed: (data_capacity satellite0) from 399 to 397, (data-stored) from 601 to 603
   goals met: 6 of 7
17. (turn_to satellite0 star0 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 16.877 to 16.0525, (fuel-used) from 142.123 to 142.947
   goals met: 6 of 7
18. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 6 of 7
19. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 6 of 7
20. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 6 of 7
21. (turn_to satellite0 planet10 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 16.0525 to 15.228, (fuel-used) from 142.947 to 143.772
   goals met: 6 of 7
22. (turn_to satellite0 phenomenon8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 15.228 to 6.572, (fuel-used) from 143.772 to 152.428
   goals met: 6 of 7
23. (take_image satellite0 phenomenon8 instrument0 image1)
   added: (have_image phenomenon8 image1)
   changed: (data_capacity satellite0) from 397 to 161, (data-stored) from 603 to 839
   goals met: 7 of 7
